{
    "text": "Skip to main content\nOpen search field\nApply\nNow\nAbout\nAcademics\nCampus Life\nAdmissions\nAthletics\nGive\nI am...\nQuick Links\nImage\nMEET THE MOCS\nBlue and Gold Preview Day\nCome see what we're about at UTC. Meet students and faculty, take a tour of campus and even take a picture with Scrappy!\nRegister Now\nBecome a Moc!\nTake the first step to your own best.\nAPPLY TODAY!\nExplore UTC\nDiscover our treasures and\nthe possibilities of your future.\nFinancial Aid and Scholarships\nSee how affordable\na UTC education really is.\nMocs Go Vote\nGet voting information, find out how to get involved, register to vote, attend Mocs Go Vote events and more...\nImage\nHOUSING\nCollege doesn't just happen in a classroom.\nSee all our housing options\nUTC News\nGet the latest news at UTC.\nUTC Events Calendar\nFind out about the latest events happening at UTC.\nIn Crisis?\nWe are here for you with a\n24/7 Crisis Response Service.\nImage\nBE THAT MOC\nInspire, nurture and empower\nAt UTC our goal is to inspire, nurture and empower scholarship, creativity, discovery, innovation and entrepreneurial initiatives.\nFind your place at UTC\nStudent organizations, athletics, campus recreation and more.\nStrategic Plan\nView and download\nVice Chancellor for Advancement and Executive Director of the University of Chattanooga Foundation\nSpace holder\nLatest News\nBreaking barriers: UTC pre-health students earn free CMA certification and paid experience at Erlanger \nUTC’s Megan McKnight honored by White House for leadership in opioid overdose prevention\nHands-on learning: UTC communication classes collaborate with local nonprofits for public relations projects\nTying it together: Recent UTC graduate merges math and science to research knot theory and neurodegenerative diseases \nChampion for mental health: UTC’s Amy Kyriakidis recognized for suicide prevention efforts\nFast track to cyber success: How an email changed a UTC student’s career trajectory\nUTC’s May nursing graduates achieve 100% pass rate on licensure exam\nMeet the Murillos: Husband and wife connecting UTC students to other cultures\nHHP Sports Lab prepares students for careers through hands-on learning and community partnership\nUniversity of Tennessee at Chattanooga\n615 McCallie Ave, Chattanooga, TN, 37403\n  423-425-4111\nUTC Info For\nStudents\nFaculty and Staff\nAlumni and Friends\nParents\nEmergency Preparedness\nParking\nVisit\nUTC Shortcuts\nMyMocsNet\nO365\nChange Password\nPeople Directory\nEvent Calendar\nWork at UTC\nCAS Login\nTitle IX Statement | Privacy Statement | Accessibility | Web Services\nA comprehensive, community-engaged campus of the University of Tennessee System and partner in the Tennessee Transfer Pathway.\nScroll to the top"
}